import React from 'react';
import {Text, StyleSheet, ScrollView, View} from 'react-native';
import {SafeAreaView} from 'react-native-safe-area-context';

export const PrivacyPolicyScreen = () => {
  return (
    <SafeAreaView edges={['bottom']} style={styles.container}>
      <ScrollView style={styles.wrapper}>
        <Text style={styles.paragraph}>
          付佳是“Cogito”软件的运营者，本《隐私政策》（以下简称“本政策”）阐述了“Cogito”将如何收集、使用、保存、共享、转让和公开披露您的个人信息和隐私信息，并申明了“Cogito”对保护隐私的承诺，“Cogito”未来有可能根据信息处理情境不时更新或修改本政策。
          本政策将帮助您了解以下内容：
        </Text>
        <Text style={styles.paragraph}>一、我们如何收集和使用您的个人信息</Text>
        <Text style={styles.paragraph}>二、我们会如何使用Cookies和同类技术</Text>
        <Text style={styles.paragraph}>三、我们会如何共享、转让、公开披露您的个人信息</Text>
        <Text style={styles.paragraph}>四、我们会如何保护和保存您的个人信息</Text>
        <Text style={styles.paragraph}>五、您的权利</Text>
        <Text style={styles.paragraph}>六、第三方提供商及其服务</Text>
        <Text style={styles.paragraph}>七、我们会如何处理未成年人的个人信息</Text>
        <Text style={styles.paragraph}>八、本政策如何更新</Text>
        <Text style={styles.paragraph}>九、联系我们</Text>
        <Text style={styles.paragraph}>
          请您在向"Cogito"提交个人信息或隐私信息之前，充分阅读、了解并同意本政策和任何补充政策。本政策设计的相关术语，我们尽量以简明扼要的方式进行表述，以便您更好的理解。
          您使用或更新本政策后(我们会及时提醒您更新的情况)继续使用我们的服务，即意味着您同意
          本政策(含更新版本)内容，并且同意我们按照本政策手机、使用、缓存、共享、转让和公开披露您的相关信息
        </Text>
        <Text style={styles.paragraph}>一、我们如何收集和使用您的个人信息</Text>
        <Text style={styles.paragraph}>
          个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别自然人个人身份的各种信息，包括但不限于基本信息（包括个人姓名、生日、性别、住址、个人电话号码、电子邮箱等）、个人身份信息（包括身份证、军官证、护照、驾驶证等）、面部识别特征、网络身份标识信息（包括系统账号、IP地址、邮箱地址及与前述有关的密码、口令、口令保护答案等）、个人财产信息（包括交易记录、
          金币、优惠券、虚拟货币、游戏类兑换码等虚拟财产信息）、个人上网记录（包括网站浏览记录、软件使用记录、点击记录等）、个人常用设备信息
          （包括硬件序列号、设备MAC地址、软件列表、唯一设备识别码（如IMEI/android
          ID/IDFA/OPENUDID/GUID、SIM卡IMSI信息等在内的描述个人常用设备基本情况的信息）及个人位置信息（精准定位信息、经纬度等）。
          个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息，本政策涉及
          的个人敏感信息包括但不限于个人财产信息（包括交易记录、金币、优惠券、虚拟货币、游戏类兑换码等虚拟财产信息）、个人身份信息
          （包括身份证、军官证、护照、驾驶证等）、面部识别特征、网络身份标识信息（包括账户名、账户昵称、邮箱地址及与前述有关的密码与密码保护问题和答案等）
          及其他信息（包括手机号码、网页浏览记录、精准定位信息等）。
          您的个人信息会在您注册和使用我们的服务时被收集，“Cogito”仅会出于本政策所述的以下目的收集和使用您的个人信息：
        </Text>
        <Text style={styles.title}>（一）您需授权我们收集和使用您个人信息的情形</Text>
        <Text style={styles.paragraph}>
          我们的服务包括核心业务功能和附加功能。我们的服务包括一些核心业务功能，这些功能包含了实现获取优质的网购优惠信息、使用信息发布服务所必须的功能，改进我们提供的信息分发、推荐及其他服务所必须的功能，保障网站安全所必须的功能及客服与账号申诉、举报投诉功能等。我们可能会收集、使用下列与您有关的信息才能实现上述这些功能，如果您不提供相关信息，您可能无法享受我们提供的部分服务。
        </Text>
        <Text style={styles.paragraph}>1、实现获取优质的网购优惠信息、使用信息发布服务所必须的功能</Text>
        <Text style={styles.paragraph}>
          （1）您使用“Cogito”提供的服务，可以注册并登录经注册的“Cogito”账号。当你注册“Cogito”账号时，您需向我们提供您的昵称、头像（如有）、手机号码等信息，我们将通过发送短信验证码的方式来验证您的身份是否有效。手机号码属于敏感信息，收集此类信息是为了满足相关法律法规的网络实名制要求。如您拒绝提供手机号码或进行实名验证，您仍可浏览“Cogito”平台的内容、通过“Cogito”平台内容链接购买商品，但将无法使用信息发布服务等其他全部或部分“Cogito”提供的服务。您可以修改补充您的昵称、电子邮箱、手机号码、个人简介等相关信息。您补充的信息将有助于我们为您提供个性化的商品推荐和更优质的服务体验，但如果您不提供这些补充信息，不会影响您使用“Cogito”平台的核心业务功能。
        </Text>
        <Text style={styles.paragraph}>
          （2）我们通过您主动填写，获取您和家人的出生日期、性别、身高体重等身体数据，“Cogito”重视个人信息安全，我们的网络服务采取了传输层安全协议等加密技术，确保用户信息在传输过程中的安全，并对保存和传输的个人敏感信息的环境定期进行病毒查杀以及系统漏铜扫描检测，我们采取一切合理可行的措施，尽全力保护您的个人信息。但如您拒绝填写此类信息，仍可浏览“Cogito”平台的内容、通过“Cogito”平台内容链接购买商品。您补充的信息仅用于我们为您提供个性化的商品推荐和优质的服务，但如果您不提供，不会影响您使用“Cogito”的核心功能。
        </Text>
        <Text style={styles.paragraph}>
          （3）为了让您快速地找到您所需要的商品信息，我们可能会收集您使用我们的服务的个人常用设备信息、服务提供商网络ID（PLMN）及浏览器类型等信息来为您提供商品信息展示的最优方式。我们也会为了不断改进和优化上述的功能来使用您的上述个人信息。
        </Text>
        <Text style={styles.paragraph}>
          （4）您也可以通过搜索来精准地找到您所需要的商品或服务。我们可能会保留您的搜索内容以方便您重复输入或为您展示与您搜索内容相关联的商品或服务。请您注意，您的搜索关键词信息无法单独识别您的身份，不属于您的个人信息，我们有权以合法的目的对其进行使用；只有当您的搜索关键词信息与您的其他信息相互结合使用并可以识别您的身份时，则在结合使用期间，我们会将您的搜索关键词信息作为您的个人信息，与您的搜索历史记录一同按照本政策对其进行处理与保护。
        </Text>
        <Text style={styles.paragraph}>2、改进我们提供的信息分发、推荐及其他服务所必须的功能</Text>
        <Text style={styles.paragraph}>
          为了改进我们提供的信息分发、推荐及其他服务，将您可能感兴趣的商品或服务信息展示给您，邀请您参与相关活动和市场调查，同时帮助我们设计新服务，提升现有服务体验，我们可能会收集您的个人常用设备信息、个人上网记录、IP地址、个人位置信息等信息，并以此开展内部审计、进行数据分析、形成用户画像。我们还可能为了提供服务及改进服务质量的合理需要而获得您的其他信息，包括您与客服联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息，以及您与我们的关联方、我们合作伙伴之间互动时我们获得的相关信息。对于从您的各种设备上收集到的信息，我们可能会将它们进行关联，以便我们能在这些设备上为您提供一致的服务。我们可能会将来自某项服务的信息与来自其他服务的信息结合起来，以便为您提供服务、个性化内容和建议。
        </Text>
        <Text style={styles.paragraph}>3、保障网站安全所必须的功能</Text>
        <Text style={styles.paragraph}>
          为提高您使用我们的服务时系统的安全性并保障网站数据安全，更准确地预防钓鱼网站欺诈和保护账户安全，我们可能会通过了解您的浏览信息、设备信息等手段来判断您的账号风险，并可能会记录一些我们认为有风险的链接（“URL”）；我们也会将收集到的您的有关信息对“Cogito”系统问题进行分析、统计流量并排查可能存在的风险、在您选择向我们发送异常信息时予以排查。
        </Text>
        <Text style={styles.paragraph}>4、客服与账号申诉、举报投诉功能</Text>
        <Text style={styles.paragraph}>
          当您与我们的客服进行联系咨询或者向我们进行账号申诉、举报投诉时，为了方便与您联系或帮助您解决问题，我们可能会收集并记录您的昵称、姓名、手机号码、电子邮箱及其他联系方式等个人信息。如您拒绝提供上述信息，我们可能无法向您及时反馈咨询或申诉、举报投诉结果。
        </Text>
        <Text style={styles.paragraph}>（二）您可选择是否授权我们收集和使用您的个人信息的情形</Text>
        <Text style={styles.paragraph}>
          为使您获得更优质的服务，提升您的使用体验，我们的以下附加功能中可能会收集和使用您的个人信息，您可以选择是否开通和使用这些附加功能。如果您不提供这些个人信息，您依然可以使用“Cogito”平台的核心业务功能，但您可能无法使用部分附加功能。
        </Text>
        <Text style={styles.paragraph}>
          三）征得授权同意的例外 根据相关法律法规的规定，以下情形中收集您的个人信息无需征得您的授权同意:
        </Text>
        <Text style={styles.paragraph}>（1）与国家安全、国防安全直接相关的；</Text>
        <Text style={styles.paragraph}>（2）与公共安全、公共卫生、重大公共利益直接相关的；</Text>
        <Text style={styles.paragraph}>（3）与犯罪侦查、起诉、审判和判决执行等直接相关的；</Text>
        <Text style={styles.paragraph}>
          （4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
        </Text>
        <Text style={styles.paragraph}>（5）所收集的个人信息是您自行向社会公众公开的；</Text>
        <Text style={styles.paragraph}>
          （6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
        </Text>
        <Text style={styles.paragraph}>
          （8）用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
        </Text>
        <Text style={styles.paragraph}>（9）法律法规规定的其他情形。</Text>
        <Text style={styles.paragraph}>（四）我们可能从第三方获取您个人信息的情形</Text>
        <Text style={styles.paragraph}>
          1、您可以使用第三方账号（如微信快捷登陆、支付宝快捷登陆等）登陆“Cogito”平台。此时您同意授权我们读取您在该第三方平台上登记、公布、记录的公开信息（包括但不限于您在第三方平台的唯一标识ID、昵称、头像等）。对于我们要求但第三方无法提供的个人信息，我们仍可以要求您补充提供。我们可能从第三方获取您的上述信息的目的是为了记住您作为“Cogito”用户的登录身份，并向您提供个性化推荐，以助于我们向您提供更优质的服务。您可以自行对您享有的上述第三方账号与“Cogito”平台进行绑定和解绑操作。
        </Text>
        <Text style={styles.paragraph}>
          （1）我们通过调用com.amap.api(高德地图;高德导航;高德定位;阿里高德地图;高德),
          为您提供配送地址选择和查看的功能。
        </Text>
        <Text style={styles.paragraph}>
          （2）我们通过调用com.getui(个推;个数应用统计;个像), com.g.gysdk(个推),
          com.igexin.sdk(个推;个推推送;)，为您提供消息推送的功能。
        </Text>
        <Text style={styles.paragraph}>
          （3）我们通过调用com.alipay(支付宝;阿里乘车码;阿里芝麻信用实名认证;芝麻认证)，为您提供支付宝付款的功能。
        </Text>
        <Text style={styles.paragraph}>（五）设备权限调用</Text>
        <Text style={styles.paragraph}>
          我们在提供服务的过程中，可能需要您开通一些设备权限，例如通知、相册、相机、麦克风、定位等访问权限。当您通过本应用下载、保存图片时，我们会请求你的存储权限，如拒绝提供存储权限，您将无法使用保存图片功能。您也可以在设备的设置功能中随时选择关闭部分或者全部权限，从而拒绝我们收集相应的个人信息。在不同设备中，权限显示方式及关闭方式可能有所不同，具体请参考设备及系统开发方说明或指引。
        </Text>
        <Text style={styles.paragraph}>
          请您注意，您开启这些权限即代表您授权我们可以按本政策的规定收集和使用这些个人信息，您关闭权限即代表您取消了这些授权，则我们将不再继续收集和使用您的这些个人信息，也无法为您提供上述与这些授权所对应的功能。您关闭权限的决定不会影响此前基于您的授权所进行的个人信息的处理。
        </Text>
        <Text style={styles.paragraph}>（六）设备权限调用</Text>
        <Text style={styles.paragraph}>
          1、我们会根据本政策的约定并为实现我们的服务功能对所收集的个人信息进行使用。
        </Text>
        <Text style={styles.paragraph}>
          2、请您注意，您在使用我们的服务时所提供的所有个人信息，除非您删除或通过系统设置拒绝我们收集，否则将在您使用我们的服务期间持续授权我们使用。在您注销账号后，我们将停止为您提供服务，您的个人信息将在“Cogito”全站匿名化处理，使您的账号处在不可被检索、访问的状态，并在符合相关法律法规规定的前提下删除您的个人信息。
        </Text>
        <Text style={styles.paragraph}>
          3、当我们要将您的个人信息用于本政策未载明的其他用途时，或基于特定目的收集而来的信息用于其他目的时，会通过您主动做出勾选或其他合法形式事先征求您的同意。
        </Text>
        <Text style={styles.paragraph}>
          4、根据法律法规的规定，经过处理无法识别特定个人且不能复原的信息不属于个人信息，我们有权自行决定收集、使用该部分信息，包括但不限于对该类信息进行分析并予以商业化的利用。
        </Text>
        <Text style={styles.paragraph}>二、我们会如何使用Cookies和同类技术</Text>
        <Text style={styles.paragraph}>
          您使用我们的服务时，我们会在您的计算机或移动设备上存储名为Cookies的小数据文件。Cookies通常包含标识符、站点名称以及一些号码和字符。我们使用该等信息判断注册用户是否已经登录，提升服务质量及优化用户体验。
          我们不会将Cookies用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookies。您可以清除计算机上保存的所有Cookies，大部分网络浏览器都设有阻止Cookies的功能。但如果您这么做，您可能需要在每一次访问我们的网站时亲自更改用户设置，而且您之前所记录的相应信息也均会被删除，并且可能会对您所使用服务的安全性有一定影响。
        </Text>
        <Text style={styles.paragraph}>三、我们会如何共享、转让、公开披露您的个人信息 </Text>
        <Text style={styles.paragraph}>（一）共享</Text>
        <Text style={styles.paragraph}>
          我们不会在未经您同意或授权的情况下向任何公司、组织和个人分享您的个人信息，但是您在此同意，我们可在以下情况下共享您的个人信息：
        </Text>
        <Text style={styles.paragraph}>
          1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。
        </Text>
        <Text style={styles.paragraph}>
          2、我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。
        </Text>
        <Text style={styles.paragraph}>
          3、与我们的关联公司共享：在本政策声明的使用目的范围内，您的个人信息可能会与我们的关联公司共享。作为一项政策，我们只会共享必要的信息。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。
        </Text>
        <Text style={styles.paragraph}>
          4、与授权合作伙伴共享：我们可能会与授权合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如，我们向您寄送礼品（如有）时，我们必须与物流服务提供商共享您的个人信息才能安排寄送，或者安排合作伙伴提供服务。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。
        </Text>
        <Text style={styles.paragraph}>目前，我们的授权合作伙伴主要包括以下类型（包含中国境内和中国境外实体）：</Text>
        <Text style={styles.paragraph}>
          （1）广告、分析服务类的授权合作伙伴。例如，由于“Cogito”平台上可能包含第三方推广信息，为监测推广信息投放效果，如您浏览或点击该等第三方推广信息，我们可能允许该第三方收集您的用户ID、个人上网记录、个人常用设备信息、IP地址、网络类型、网络运营商等信息；同时，我们会授权第三方数据统计、分析机构获取用户ID、性别、年龄、籍贯、个人上网记录、个人常用设备信息、交易记录、IP地址等信息，向我们提供网站访问数据统计和分析服务；我们的授权合作伙伴也可能将我们向其提供的信息与其数据库中的信息进行匹配和分析，并向我们返回分析结果。
        </Text>
        <Text style={styles.paragraph}>
          （2）供应商、服务提供商和其他合作伙伴。我们将信息发送给在全球范围内支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括但不限于提供技术基础设施服务或其他技术支持、分析我们服务的使用方式、衡量广告和服务的有效性、提供客户服务、支付便利或进行学术研究和调查。例如，当您使用“Cogito”的账号联合登陆第三方网站时，我们可能向该等第三方网站提供您的对外唯一标识ID、昵称、头像及用户个人中心主页地址等信息。
        </Text>
        <Text style={styles.paragraph}>
          对我们与之共享个人信息的公司、组织和个人，我们会与其签署相应的保密协定，如获取您个人信息的公司、组织或个人超出本政策规定使用您个人信息的，其应当另行取得您的授权同意。
        </Text>
        <Text style={styles.paragraph}>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</Text>
        <Text style={styles.paragraph}>（二）转让 </Text>
        <Text style={styles.paragraph}>
          2、在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
        </Text>
        <Text style={styles.paragraph}>我们仅会在以下情况下，公开披露您的个人信息：</Text>
        <Text style={styles.paragraph}>（三）公开披露 </Text>
        <Text style={styles.paragraph}>1、获得您明确同意后；</Text>
        <Text style={styles.paragraph}>
          2、基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
        </Text>
        <Text style={styles.paragraph}>四、我们会如何保护和保存您的个人信息 </Text>
        <Text style={styles.paragraph}>（一）我们保护您个人信息的技术与措施</Text>
        <Text style={styles.paragraph}>
          1、“Cogito”重视个人信息的安全。我们采取互联网业内标准做法来保护您的个人信息，防止信息遭到未经授权的访问、披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，我们的网络服务采取了传输层安全协议等加密技术，通过https等方式提供浏览服务，确保用户信息在传输过程中的安全；我们通过采取加密技术对用户个人信息进行加密保存，且我们对用户个人敏感信息的保存和传输均采取强加密算法的单向哈希，同时会对加密算法进行加密保护，并对保存和传输的个人敏感信息的环境定期进行病毒查杀以及系统漏洞扫描检测。
        </Text>
        <Text style={styles.paragraph}>
          2、我们设有信息安全委员会，统一协调管理数据安全工作，并下设信息安全执行小组和信息安全审核小组，推动各项信息和数据安全活动；我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
        </Text>
        <Text style={styles.paragraph}>
          3、我们仅允许有必要知晓这些信息的“Cogito”及“Cogito”关联方的员工、合作伙伴访问个人信息，并为此设置了严格的访问权限控制和监控机制。我们同时要求可能接触到您个人信息的人员履行相应的保密义务，如果未能履行这些义务，可能会被追究法律责任或被中止终止与我们的合作关系。
        </Text>
        <Text style={styles.paragraph}>
          4、我们会采取一切合理可行的措施，确保未收集与“Cogito”提供的服务无关的个人信息。
        </Text>
        <Text style={styles.paragraph}>
          5、我们会尽全力保护您的个人信息，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。
        </Text>
        <Text style={styles.paragraph}>
          6、在发生个人信息安全事件时，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
        </Text>
        <Text style={styles.paragraph}>二）我们如何保存您的个人信息</Text>
        <Text style={styles.paragraph}>
          1、原则上，我们在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内。
        </Text>
        <Text style={styles.paragraph}>
          2、以下情形中，我们会履行法律规定的义务后，向可能的境外实体提供您的个人信息：
        </Text>
        <Text style={styles.paragraph}>（1）适用的法律有明确规定；</Text>
        <Text style={styles.paragraph}>（2）获得您的单独同意；</Text>
        <Text style={styles.paragraph}>（3）您作为一方当事人的跨境电子商务交易及其他类型合同定力和履行所必需的。</Text>
        <Text style={styles.paragraph}>针对以上情形，我们会按照本政策衣服保护您的个人信息安全。</Text>
        <Text style={styles.paragraph}>五、您的权利</Text>
        <Text style={styles.paragraph}>
          我们非常重视您对个人信息的关注，并尽全力保护您对于您个人信息访问、更正、删除以及注销账号的权利，以使您拥有充分的能力保障您的隐私和安全。您的权利包括：
        </Text>
        <Text style={styles.paragraph}>
          1、您可以按照我们的相关政策及“Cogito”平台页面提示，通过“我的”页面（APP端）等相关功能对您的个人信息进行访问、更正及删除；具体权限及方式以“Cogito”平台相关页面显示的操作要求及信息为准。同时，我们将尽一切可能采取适当的技术手段，保证收集到的有关于您的个人信息的准确性，并保证及时进行更新。
        </Text>
        <Text style={styles.paragraph}>
          2、我们尊重您的个人选择权。您可以按照我们的相关政策及“Cogito”平台页面提示进行隐私设置，具体设置路径以“Cogito”平台相关页面显示的操作要求及信息为准。
        </Text>
        <Text style={styles.paragraph}>
          3、注销账户。您可注销您注册的“Cogito”账户，具体注销路径以“Cogito”平台相关页面显示的操作要求及信息为准。关于您注销账户应满足的条件及注销账户对您的影响，请详见《Cogito账户注销协议》及相关提示页面。
        </Text>
        <Text style={styles.paragraph}>4、响应您的请求</Text>
        <Text style={styles.paragraph}>
          如果您无法通过上述方式访问、更正或删除您的个人信息，或您需要访问、更正或删除您在使用我们服务时所产生的其他个人信息，或您认为我们存在任何违反法律法规或与您关于个人信息的收集使用的约定，您均可以通过“Cogito”平台的“在线客服”（APP端）与我们联系。为了保障安全，我们可能需要您提供书面请求，或以其他方式证明您的身份，我们将在收到您反馈并验证您的身份后的30天内答复您的请求。对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情形收取一定成本费用。对于那些无端重复、需要过多技术手段（例如需要开发新系统或从根本上改变现行惯例等）、给他人合法权益带来风险或者非常不切实际（例如涉及备份磁带上存放的信息等）的请求，我们可能会予以拒绝。
        </Text>
        <Text style={styles.paragraph}>在以下情形中，按照法律法规要求，我们将无法响应您的请求：</Text>
        <Text style={styles.paragraph}>（1）与国家安全、国防安全直接相关的；</Text>
        <Text style={styles.paragraph}>（2）与公共安全、公共卫生、重大公共利益直接相关的；</Text>
        <Text style={styles.paragraph}>（3）与犯罪侦查、起诉、审判和判决执行等直接相关的；</Text>
        <Text style={styles.paragraph}>（4）有充分证据表明您存在主观恶意或滥用权利的；</Text>
        <Text style={styles.paragraph}>（5）响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；</Text>
        <Text style={styles.paragraph}>（6）涉及商业秘密的。</Text>
        <Text style={styles.paragraph}>六、第三方提供商及其服务</Text>
        <Text style={styles.paragraph}>
          为确保流畅的浏览体验，您可能会收到来自“Cogito”及其合作伙伴外部的第三方（以下简称“第三方”）提供的内容或网络链接。“Cogito”对此类第三方无控制权。您可选择是否访问第三方提供的链接、内容、产品和服务。
        </Text>
        <Text style={styles.paragraph}>
          我们无法控制第三方的隐私和个人信息保护政策，此类第三方不受到本政策的约束。您在向第三方提交个人信息之前，请确保您阅读并认可这些第三方的隐私保护政策。
        </Text>
        <Text style={styles.paragraph}>七、我们会如何处理未成年人的个人信息</Text>
        <Text style={styles.paragraph}>
          我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本政策，并建议未成年人在提交个人信息之前寻求父母或监护人的同意和指导。但是，如果您确认自己能够完全理解本政策的全部内容且您为使用“Cogito”服务所进行的相关操作行为与您的年龄、智力相适应的，则您可以独立进行相关操作（包括向我们提交您的个人信息）。
        </Text>
        <Text style={styles.paragraph}>八、本政策如何更新及适用范围</Text>
        <Text style={styles.paragraph}>
          本政策为《Cogito用户使用协议》的重要组成部分。我们保留不时更新或修改本政策的权利，我们会在“Cogito”平台页面上发布对本政策所做的任何变更。对于重大变更，我们还会提供更为显著的通知（包括对于某些服务，我们会通过电子邮件发送通知，说明隐私政策的具体变更内容)。渠道向您发送变更通知，包括但不限于网站公示、私信通知、电子邮件通知等方式。
          本政策所指的重大变更包括但不限于：
        </Text>
        <Text style={styles.paragraph}>
          1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
        </Text>
        <Text style={styles.paragraph}>
          2、我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
        </Text>
        <Text style={styles.paragraph}>3、个人信息共享、转让或公开披露的主要对象发生变化；</Text>
        <Text style={styles.paragraph}>4、您参与个人信息处理方面的权利及其行使方式发生重大变化；</Text>
        <Text style={styles.paragraph}>5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</Text>
        <Text style={styles.paragraph}>6、个人信息安全影响评估报告表明存在高风险时。</Text>
        <Text style={styles.paragraph}>
          若您不同意修改后的隐私政策，您有权并应立即停止使用“Cogito”的服务。如果您继续使用“Cogito”服务，则视为您接受我们对本政策相关条款所做的修改。
        </Text>
        <Text style={styles.paragraph}>
          “Cogito”的所有服务均适用本政策。但某些服务有其特定的隐私政策，该等特定的隐私政策更具体地说明我们在该服务中如何处理您的信息。如本政策与特定服务的隐私政策有不一致之处，请以该特定隐私政策为准。
        </Text>
        <Text style={styles.paragraph}>九、联系我们</Text>
        <Text style={styles.paragraph}>
          当您对本政策有任何疑问，可以通过邮箱fujia.site@foxmail.com向我们反馈，我们将及时解决您的问题。
        </Text>
        <View style={styles.footer} />
      </ScrollView>
    </SafeAreaView>
  );
};

const styles = StyleSheet.create({
  container: {
    flex: 1,
    backgroundColor: '#fff',
  },
  wrapper: {
    paddingTop: 16,
    paddingHorizontal: 12,
  },
  paragraph: {
    color: '#333',
    marginBottom: 6,
  },
  title: {
    marginVertical: 16,
    fontWeight: 'bold',
  },
  strong: {
    fontWeight: 'bold',
  },
  footer: {
    height: 32,
  },
});
